# 1

butter <- c(8.36043, 9.84681, 11.0165, 10.3691, 11.1062, 11.5748, 10.4819, 9.57465,
            9.15738, 9.10535, 9.58175, 8.84759, 10.2, 11.4585, 9.39668, 10.3133, 
            8.78169, 9.27218, 10.5407, 9.83173, 10.9303, 10.0612, 9.83532, 9.19267, 
            10.4731, 10.1689, 8.83445, 9.57088, 10.199, 10.5173, 8.79799, 9.85155, 
            10.3257, 10.6566, 10.8768, 10.2083, 11.0509, 10.6774, 9.11585, 8.07112, 
            9.64491, 9.42134, 10.0062, 10.4985, 10.7303, 9.32261, 9.14602, 11.2338, 
            9.23383, 9.48719, 9.5061, 11.9317, 9.78455, 10.4451, 10.9098, 9.09558, 
            9.98835, 9.82078, 10.666, 9.76885, 10.2057, 9.7456, 8.81365, 8.5658, 
            10.2601, 10.3143, 10.2994, 12.8814, 10.4079, 9.30728, 10.738, 10.5298, 
            9.83119, 10.1446, 10.1131, 10.5583, 7.55672, 10.1561, 8.66302, 11.775, 
            10.1366, 8.99592, 8.95801, 7.88063, 9.5622, 7.47275, 10.9187, 9.28612, 
            10.2589, 9.5277, 10.0065, 11.5258, 11.3286, 9.98597, 9.98792, 8.11203, 
            11.7729, 10.6381, 10.2778, 9.70833, 9.59371, 10.7766, 10.9967, 10.7246, 
            8.89588, 7.76889, 10.7267, 10.5506, 10.1092, 11.3371, 10.6461, 9.43656, 
            9.40437, 7.27759, 8.45498, 11.5526, 10.1994, 11.7905, 10.0322, 10.7253, 
            10.1166, 11.6038, 10.8114, 10.977, 9.76245, 10.8306, 9.62841, 10.2817, 
            8.51568, 10.1304, 10.5641, 10.7866, 9.72824, 9.66259, 9.45735, 10.4983, 
            11.5839, 9.17528, 10.7448, 11.3197, 10.5773, 9.0155, 10.7491, 10.6606, 
            11.9538, 11.2009, 10.2015, 10.1946, 9.39697, 9.17197, 11.231, 8.76378, 
            9.39774, 8.94573, 10.785, 10.44, 10.6711, 10.6249, 8.61901, 10.134, 
            8.72391, 9.62927, 9.81301, 9.30987, 10.3448, 7.9121, 12.0301, 10.6998, 
            11.9495, 10.1075, 9.38487, 10.4665, 9.73367, 10.6054, 9.6666, 9.81792, 
            10.6, 10.3823, 10.5618, 10.2501)


# 1.Побудувати графік щільності розподілу випадкової величини ваги 
# коробки і визначити візуально схожість із нормальним законом розподілу.

plot(density(butter), col = "mediumpurple1", main = "Графік розподілу ваги вершкового масла", xlab = "Вага")


# 2.Перевірити гіпотезу про нормальний закон розподілу з використанням критерію 
# Пірсона (хі-квадрат).
?chisq.test

chisq.test(butter, p = dnorm(butter, mean = mean(butter), sd = sd(butter)))
chisq.test(butter, y = NULL, correct = TRUE, p = rep(1/length(butter)), length(butter), rescale.p = FALSE, simulate.p.value = FALSE)

shapiro.test(butter)
# У цьому випадку ви не можете відхилити нульову гіпотезу про нормальний розподіл, 
# оскільки p-value = 0.2943 перевищує звичайний рівень значущості 0.05.

 
# 3.Перевірити гіпотезу про нормальний закон розподілу з використанням 
# критерію Шапіро-Уілка.

shapiro.test(butter)

# тест Шапіро-Уілка показав, що p-value дорівнює 0.2943. Це означає,
# що немає достатніх доказів для відхилення нульової гіпотези про нормальний
# розподіл вашого набору даних, оскільки значення p перевищує зазвичай використовуваний
# рівень значущості 0.05.


# 4.Вага коробки із вершковим маслом повинна складати 10 кг. 
# Чи можна вважати,  що  відхилення  від  нормативу  в  10  кг  є  незначущим?
# Використайте для цього гіпотезу Стьюдента про рівність математичного 
# сподівання  нормально  розподіленої  випадкової  величини  заданому значенню.

t.test(butter, mu = 10)

# 2

f1 <- c (505.8, 518.87, 609.66, 617.83, 612.69, 570.39, 590.47, 587.30, 625.40,
         592.67, 515.75, 610.1, 556.13, 581.19, 619.16, 582.87, 587.03, 596.87,
         641.82, 625.25, 536.21, 567.42, 562.17, 618.09, 590.85, 600.17, 583.72, 
         612.28, 649.22, 604.14, 547.09, 542.49, 576.95, 584.77, 647.98, 542.11, 
         595.48, 614.94, 519.32, 643.29, 636.9, 601.89, 516.25, 586.6, 536.04, 
         506.26, 626.02, 644.67, 633.36, 601.76, 602.1, 528.52, 559.01, 62.68, 
         621.49, 603.23, 581.5, 542.37, 601.98, 552.09, 622.28, 523.69, 505.05, 
         519.6, 613.49, 638.14, 519.61, 554.82, 580.51, 610.98, 646.33, 557.3, 
         640.77, 600.93, 588.53, 573.53, 543.52, 500.78, 558.12, 540.42, 549.52, 
         566.26, 623.02, 608.35, 552.04, 508.68, 645.67, 573.13, 526.05, 506.91, 
         611.97, 524.78, 641.43, 527.76, 518.43, 557.26, 595.86, 527.57, 613.47, 594.05)

f2 <- c(532.24, 610.29, 505.76, 620.48, 640.18, 550.44, 506.21, 551.78, 570.84, 583.8,
        640.5, 644.33, 571.82, 621.35, 567.83, 591.8, 589.01, 555.76, 512.41, 612.62,
        582.24, 623.99, 510.45, 563.44, 612.4, 534.26, 578, 522.06, 577.15, 564.97,
        587.89, 629.24, 627.56, 538.36, 637.3, 598.15, 517.05, 578.52, 506.19, 527.82,
        552.62, 647.99, 564.67, 604.17, 631.08, 566.21, 587.81, 546.39, 591.82, 590.8,
        575.75, 629.95, 581.34, 561.15, 618.22, 568.51, 547.6, 598.52, 527.6, 622.19,
        560.65, 563.3, 530.01, 610.11, 501.88, 607.39, 552.26, 559.68, 561.49, 646.61,
        590.48, 572.23, 604.24, 560.19, 505.5, 625.82, 589.18, 583.22, 593, 537.37,
        513.07, 533.16, 536.07, 518.15, 547.72, 587.49, 507.12, 592.4, 633.52, 613.08,
        643.3, 605.31, 506.54, 535.68, 589.78, 541.01, 554.44, 577.81, 596.76, 507.38)


# 1.Побудувати в одній системі координат точкові графіки щоденної виручки 
# обох фірм. При цьому точки для кожної фірми повинні мати свій колір.

plot(f1, col = "mediumpurple1", pch = 19, xlab = "День", ylab = "Щоденна виручка", 
     main = "Щоденна виручка фірми f1 та f2")
points(f2, col = "darkolivegreen1", pch = 19)

# 2.Чи можна вважати співставними обсяги щоденної виручки обох фірм? 
# Дати  відповідь  за  результатами  перевірки  гіпотези  про  рівність 
# математичних  сподівань  обсягів виручки  двох  фірм  за  критерієм Стьюдента.

t.test(f1, f2)


# 3.Перевірити для двох фірм гіпотезу про рівність дисперсій обсягів продажу 
# з використанням критерію Фішера.

var.test(f1, f2)


# 4.Провести  кореляційний  аналіз  обсягів  
# продажу  двох  фірм.  Спочатку зробити  висновок  про  взаємозв’язок  між  
# ними  на  основі  візуального аналізу, побудувавши два графіка:
#   1)графік залежності обсягів продажу фірми 1 від обсягів продажу фірми 2;
#   2)графік залежності обсягів продажу фірми 2 від обсягів продажу фірми 1.
par(mfrow = c(1, 2))

plot(f1, f2, 
     xlab = "Обсяг продажу фірми f1", 
     ylab = "Обсяг продажу фірми f2", 
     main = "Залежність обсягів продажу між фірмами f1 та f2",
     col = "mediumpurple1")

plot(f2, f1, 
     xlab = "Обсяг продажу фірми f2", 
     ylab = "Обсяг продажу фірми f1", 
     main = "Залежність обсягів продажу між фірмами f2 та f1",
     col = "darkolivegreen1")


# 5.Використати  критерії  Пірсона,  Спірмена  та  Кендалла  для  перевірки 
# наявності кореляційного зв’язку між обсягами продажів двох фірм.

# Примітка. Якщо  при  перевірці  гіпотези  потрібно  задати рівень 
# значущості, то вказати його рівним 0.05

cor.test(f1, f2, method = "pearson", alternative = "two.sided")

cor.test(f1, f2, method = "spearman", alternative = "two.sided")

cor.test(f1, f2, method = "kendall", alternative = "two.sided")
